[
    {
      "_id": "6334908681aa2d6b2fc89721",
      "picture": "https://newscopia.in/wp-content/uploads/2022/05/React-JS.png",
      "name": "ReactJs",
      "description": "Minim consectetur ut eiusmod do reprehenderit enim non. Consectetur anim laboris non reprehenderit incididunt cupidatat eu exercitation dolor. Pariatur ad tempor nisi elit anim. Ullamco excepteur adipisicing excepteur mollit occaecat irure eu. Duis Lorem quis aliqua commodo cupidatat fugiat eu non. Consectetur quis reprehenderit commodo deserunt aliqua occaecat quis. Non magna proident ullamco ut adipisicing officia aliquip.\r\n"
    },
    {
      "_id": "63349086a02270e076e295e7",
      "picture": "https://schoolinka.com/wp-content/uploads/2019/12/javascript-1024x576.jpg",
      "name": "JavaScript",
      "description": "Voluptate officia minim consectetur esse. Esse cillum nulla in occaecat. Anim incididunt laborum dolore voluptate ad est officia anim in et cupidatat elit ea. Deserunt ut aliqua sunt incididunt id enim exercitation cillum nostrud. Proident proident ea elit tempor commodo aute commodo qui. Adipisicing labore do ipsum cupidatat. Et labore excepteur irure sit sit reprehenderit non do aute deserunt qui.\r\n"
    },
    {
      "_id": "6334908609fa8c3666849461",
      "picture": "https://disenowebakus.net/en/images/articles/html5-new-tags-effects-behaviors.jpg",
      "name": "HTML5",
      "description": "Aliqua deserunt aliqua do fugiat occaecat nulla dolore nisi magna velit anim irure commodo sint. Dolor do cillum ex culpa labore. Labore dolore exercitation ex enim aliquip. Occaecat voluptate fugiat sint magna in est mollit culpa in magna consequat consectetur excepteur. Aute do voluptate et officia. Consectetur reprehenderit pariatur id exercitation eiusmod pariatur cupidatat duis anim ex adipisicing elit. Eu ad aliquip incididunt dolor do veniam ex Lorem.\r\n"
    },
    {
      "_id": "63349086e177b741ba0f9971",
      "picture": "https://colorlib.com/cdn-cgi/image/width=1400,height=802,fit=crop,quality=80,format=auto,onerror=redirect,metadata=none/wp-content/uploads/sites/2/creative-css3-tutorials.jpg",
      "name": "CSS3",
      "description": "Sint est sit consequat irure. Proident mollit consectetur et duis minim Lorem quis cupidatat laboris ea sint consequat minim. Fugiat deserunt tempor aliqua non. Amet officia incididunt reprehenderit Lorem officia ullamco do mollit ad elit.\r\n"
    },
    {
      "_id": "63349086b9d445eaf4f36e05",
      "picture": "https://blog.getbootstrap.com/assets/img/2022/09/examples.png",
      "name": "Bootstrap",
      "description": "Aliquip nulla sunt cillum qui magna. Exercitation ad proident dolore adipisicing ipsum. Magna quis et minim ad id ut aute aute. Occaecat labore dolore enim qui Lorem eiusmod elit magna ut aliqua ipsum occaecat dolor. Tempor nostrud culpa esse id culpa et ullamco ut. Eiusmod cupidatat occaecat culpa quis ea exercitation voluptate fugiat minim nisi laboris esse laboris.\r\n"
    },
    {
      "_id": "633490868fcea1ea9077cd24",
      "picture": "https://laravelnews.imgix.net/images/tailwindcss.png?dpr=2&ixlib=php-3.3.1",
      "name": "Tailwind",
      "description": "Tempor laboris amet pariatur do culpa qui amet minim elit qui. Aute laborum est laboris do tempor magna. Et est mollit deserunt proident deserunt ea occaecat sunt anim ullamco officia amet esse ipsum. Cupidatat eu et minim do duis.\r\n"
    },
    {
      "_id": "633490866c4d1fdbc1a7be17",
      "picture": "https://cdn.thenewstack.io/media/2022/01/10b88c68-typescript-logo-1024x576.png",
      "name": "Typescript",
      "description": "Eiusmod adipisicing culpa ex aliqua officia ea ut. Esse Lorem quis fugiat aliqua velit. Duis nisi exercitation ea est ad duis ut proident culpa.\r\n"
    },
    {
      "_id": "63349086cb178216862d1df9",
      "picture": "https://web-static.wrike.com/cdn-cgi/image/width=1551,format=auto,q=80/blog/content/uploads/2019/05/Application-Programming-Interface-API-Explained-1.jpg?av=8d387ac3ad145fbd322ff0d641cd1124",
      "name": "API",
      "description": "Aliquip amet eiusmod laborum exercitation ut cupidatat proident cillum duis consectetur do proident magna laboris. Ipsum nulla elit ad fugiat deserunt commodo. Adipisicing aliquip quis cillum do mollit dolore Lorem sunt quis exercitation officia laboris.\r\n"
    },
    {
      "_id": "63349086ca1acdd3d6a1b2d1",
      "picture": "https://it-valley.com/wp-content/uploads/2022/06/kuzt9r42or1fxvlq2-Meta_Generic.png",
      "name": "MongoDB",
      "description": "Ex irure exercitation quis quis consequat ipsum cupidatat nostrud laboris anim. Cillum non cupidatat esse ullamco cupidatat irure in minim Lorem laborum ad. In elit aute nulla ea anim eiusmod consectetur exercitation. Dolore et ut sunt do Lorem enim pariatur ut ut nulla minim. Incididunt tempor ut laboris ullamco do aliqua sunt amet mollit officia sit mollit.\r\n"
    },
    {
      "_id": "63349086e425648a8a53ca64",
      "picture": "https://miro.medium.com/max/1100/1*mtsk3fQ_BRemFidhkel3dA.png",
      "name": "Git & Github",
      "description": "Velit adipisicing tempor tempor amet veniam veniam quis esse aliquip. Et anim commodo minim reprehenderit culpa et aliqua duis non reprehenderit eiusmod occaecat. Incididunt ea ad exercitation consequat excepteur voluptate. Dolor eu proident est aliqua elit aliquip elit pariatur laboris. Non eiusmod non cillum commodo excepteur magna sunt sit est et sunt amet ullamco. Ullamco excepteur magna enim nisi consequat eiusmod.\r\n"
    },
    {
      "_id": "63349086fd673504f7b2ce3a",
      "picture": "https://miro.medium.com/max/1100/1*xDi2csEAWxu95IEkaNdFUQ.png",
      "name": "React Native",
      "description": "Qui excepteur consectetur veniam eiusmod eiusmod consequat exercitation consectetur. Officia eiusmod culpa ex minim ullamco in eiusmod aute. Sint enim laborum consectetur enim non incididunt dolore eu cupidatat commodo et proident velit officia. Ipsum ullamco consequat sit reprehenderit. Et amet duis sit cillum duis est et non. Irure ea sint adipisicing mollit reprehenderit officia exercitation proident.\r\n"
    },
    {
      "_id": "633490865a5baa25e6ab23e1",
      "picture": "https://i.ytimg.com/vi/fgT6r4f9Apc/maxresdefault.jpg",
      "name": "Firebase",
      "description": "Nulla amet est amet magna cillum consequat. Minim laboris dolor qui enim duis et officia ad ad. Adipisicing in laboris et ea occaecat proident aliquip exercitation reprehenderit et nulla fugiat cillum velit.\r\n"
    }
  ]